In [1]:
import numpy as np
import pandas as pd

In [3]:
lst = [1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
arr = np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [5]:
pd.Series(index=['Eshant','Pranjal','Jayesh','Ashsih'],data=[1,2,3,4])

Eshant     1
Pranjal    2
Jayesh     3
Ashsih     4
dtype: int64

In [9]:
steps = {'day1':4000,'day2':3000,'day3':12000}
pd.Series(steps)

day1     4000
day2     3000
day3    12000
dtype: int64

In [10]:
pd.Series(5).repeat(3)

0    5
0    5
0    5
dtype: int64

In [12]:
pd.Series(5).repeat(3).reset_index(drop=True)

0    5
1    5
2    5
dtype: int64

In [21]:
s=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)

In [22]:
s[4]

10

In [25]:
s[6]

20

In [26]:
s[2:-2]

2    10
3    10
4    10
dtype: int64

In [28]:
sr=pd.Series([1,2,3,4,5,6,7])
sr.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

In [29]:
sr = pd.Series([1,-2,3,-4,5,-6,7])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [31]:
sr1 = pd.Series([1,-2,3])
sr2 = pd.Series([1,2,3])
sr3 = sr2.append(sr1)
sr3

C:\Users\Gaurav\AppData\Local\Temp\ipykernel_20696\4220463043.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sr3 = sr2.append(sr1)

0    1
1    2
2    3
0    1
1   -2
2    3
dtype: int64

In [32]:
sr.reset_index(drop=True)

0    1
1   -2
2    3
3   -4
4    5
5   -6
6    7
dtype: int64

In [33]:
sr1

0    1
1   -2
2    3
dtype: int64

In [35]:
type(sr1[0])

numpy.int64

In [38]:
sr1.astype('float')

0    1.0
1   -2.0
2    3.0
dtype: float64

In [39]:
sr1 = pd.Series([1,2,30,4,5,6,7,8,9,20])
sr1

0     1
1     2
2    30
3     4
4     5
5     6
6     7
7     8
8     9
9    20
dtype: int64

In [43]:
sr1.between(10,50)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [53]:
ser = pd.Series(["  Eshant Das" , "Data Science " , "Geeks for Geeks " , ' Hello World' , 'Machine Learning'])
print(ser.str.upper())
print('-'*30)
print(ser.str.lower())

0          ESHANT DAS
1       DATA SCIENCE
2    GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object
------------------------------
0          eshant das
1       data science
2    geeks for geeks
3         hello world
4    machine learning
dtype: object

In [54]:
for i in ser:
    print(i,len(i))

  Eshant Das 12
Data Science  13
Geeks for Geeks  16
 Hello World 12
Machine Learning 16

In [55]:
ser = ser.str.strip()

In [56]:
for i in ser:
    print(i,len(i))

Eshant Das 10
Data Science 12
Geeks for Geeks 15
Hello World 11
Machine Learning 16

In [57]:
ser.str.split()

0          [Eshant, Das]
1        [Data, Science]
2    [Geeks, for, Geeks]
3         [Hello, World]
4    [Machine, Learning]
dtype: object

In [58]:
ser.str.split()[0]

['Eshant', 'Das']

In [60]:
ser.str.split()[4]

['Machine', 'Learning']

In [61]:
ser = pd.Series(["Eshant Das","Data@Science","Geeks for Geeks",'Hello@World','Machine Learning'])

ser.str.contains('@')

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [62]:
ser.str.replace('@',' ')

0          Eshant Das
1        Data Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [64]:
ser.str.count('a')

0    2
1    2
2    0
3    0
4    2
dtype: int64

In [65]:
ser.str.startswith('D')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [66]:
ser.str.endswith('s')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [68]:
ser.str.find('Geeks')

0   -1
1   -1
2    0
3   -1
4   -1
dtype: int64

In [69]:
ser.to_list()

['Eshant Das',
 'Data@Science',
 'Geeks for Geeks',
 'Hello@World',
 'Machine Learning']

In [71]:
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']

pd.DataFrame(lst)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [72]:
lst = [['tom',10],['jerry',12],['spike',14]]
pd.DataFrame(lst)

       0   1
0    tom  10
1  jerry  12
2  spike  14

In [74]:
data = {'name':['Tom', 'nick', 'krish', 'jack'], 'age':[20, 21, 19, 18]}
pd.DataFrame(data)

    name  age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [79]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data)
df[['Name','Qualification']]

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [80]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [85]:
df.loc[1:2,'two':'three']

   two  three
1   20    200
2   30    300

In [86]:
df.iloc[1:-1,1:-1]

   two  three
1   20    200
2   30    300

In [87]:
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400

In [88]:
df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

In [89]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [93]:
df.loc[df['two']>=20,['three','four']]

   three  four
1    200  2000
2    300  3000
3    400  4000

In [94]:
df.loc[df['three']<300,['one','four']]

   one  four
0    1  1000
1    2  2000

In [95]:
l=[22,33,44,55]
df['five']=l
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

In [96]:
sr = pd.Series([111,222,333,444])
df['six'] = sr
df

   one  two  three  four  five  six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

In [97]:
df['seven']=df['one']+10
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111     11
1    2   20    200  2000    33  222     12
2    3   30    300  3000    44  333     13
3    4   40    400  4000    55  444     14

In [98]:
del df['six']

In [99]:
df

   one  two  three  four  five  seven
0    1   10    100  1000    22     11
1    2   20    200  2000    33     12
2    3   30    300  3000    44     13
3    4   40    400  4000    55     14

In [101]:
df.pop('five')

0    22
1    33
2    44
3    55
Name: five, dtype: int64

In [102]:
df

   one  two  three  four  seven
0    1   10    100  1000     11
1    2   20    200  2000     12
2    3   30    300  3000     13
3    4   40    400  4000     14

In [105]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df3 = df1.append(df2).reset_index(drop=True)
df3

C:\Users\Gaurav\AppData\Local\Temp\ipykernel_20696\3854175277.py:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2).reset_index(drop=True)

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [114]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [115]:
df.drop([0,1],axis=0,inplace=True)

In [116]:
df

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [117]:
df.drop(['one','three'],axis=1,inplace=True)

In [118]:
df

   two  four
2   30  3000
3   40  4000

In [120]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [121]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

In [122]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [123]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [124]:
df.ndim

2

In [125]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [126]:
df.shape

(4, 4)

In [127]:
df.head(2)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000

In [128]:
df.tail(2)

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [129]:
df = pd.DataFrame()
df.empty

True

In [130]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [132]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [133]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [134]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [135]:
de = pd.DataFrame({'A': [1, 2, 2, 3, 4, 4, 4, 5], 'B': [10, 20, 20, 30, 40, 40, 50, 60]})

print('A' , de['A'].mode())
print('B' , de['B'].mode())

A 0    4
Name: A, dtype: int64
B 0    20
1    40
Name: B, dtype: int64

In [136]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

In [137]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

In [138]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [139]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

In [140]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000]),
        'five' : pd.Series(['A','B','C','D'])}
df = pd.DataFrame(data)
df

   one  two  three  four five
0    1   10    100  1000    A
1    2   20    200  2000    B
2    3   30    300  3000    C
3    4   40    400  4000    D

In [142]:
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

In [143]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [144]:
def add(i,j):
    return i+j
df.pipe(add,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [145]:
def mean_(col):
    return col.mean()

def square(i):
    return i ** 2

df.pipe(mean_).pipe(square)

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

In [146]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [149]:
print(df.apply(np.mean))

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [151]:
df.apply(lambda x:x.max()-x.min())

one         3
two        30
three     300
four     3000
dtype: int64

In [154]:
df.applymap(lambda x:x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [159]:
df = pd.DataFrame({ 'A': [1.2, 3.4, 5.6], 
                    'B': [7.8, 9.1, 2.3]})

df_1 = df.applymap(np.int64)
print(df_1)

   A  B
0  1  7
1  3  9
2  5  2

In [161]:
df_2 = df.apply(lambda row:row.mean(),axis=0)
print(df_2)

A    3.4
B    6.4
dtype: float64

In [165]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
print(df)
print('-'*30)
print(df.reindex([1,0,3,2]))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
------------------------------
   one  two  three  four
1    2   20    200  2000
0    1   10    100  1000
3    4   40    400  4000
2    3   30    300  3000

In [167]:
data = {'Name' : ['John', 'Jane', 'Jim', 'Joan'],
        'Age'  : [25, 30, 35, 40],
        'City' : ['New York', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)
df.reindex(columns=['Name','City','Age'])

   Name         City  Age
0  John     New York   25
1  Jane  Los Angeles   30
2   Jim      Chicago   35
3  Joan      Houston   40

In [169]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df.rename(columns={'one' : 'One','two': 'Two', 'three' : 'Three', 'four' : 'Four'}, 
           inplace = True, index = {0:'a',1:'b',2:'c',4:'d'})
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
3    4   40    400  4000

In [170]:
data = { 'one'   : pd.Series([11, 51, 31, 41]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0   11   10    100  1000
1   51   20    200  2000
2   31   30    500  3000
3   41   40    400  4000

In [176]:
df.sort_values(by="one",ascending=False)

   one  two  three  four
1   51   20    200  2000
3   41   40    400  4000
2   31   30    500  3000
0   11   10    100  1000

In [177]:
df.sort_values(by = ['one','two'])

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

In [178]:
df.sort_values(by = ['one'], kind = 'quicksort')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

In [179]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}
df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [182]:
df.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [183]:
df.groupby(['Team','Year']).get_group(('Australia',2014))

        Team  Rank  Year  Points
2  Australia     1  2014     891

In [184]:
df.groupby("Team").sum()["Points"]

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

In [186]:
df.groupby("Team").sum()["Points"].sort_values(ascending=True)

Team
Australia    1706
NZ           2332
India        2459
SA           3218
Name: Points, dtype: int64

In [188]:
groups = df.groupby('Team')

groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min,np.var])

            sum        mean        std  amax  amin          var
Team
Australia  1706  853.000000  53.740115   891   815  2888.000000
India      2459  819.666667  49.702448   876   782  2470.333333
NZ         2332  777.333333  97.449132   883   691  9496.333333
SA         3218  804.500000  28.769196   834   776   827.666667

In [189]:
df.groupby("Team").filter(lambda x:len(x)==4)

  Team  Rank  Year  Points
4   SA     3  2014     776
5   SA     4  2015     784
6   SA     1  2016     834
7   SA     1  2017     824

In [194]:
df.groupby("Team").filter(lambda x:len(x)==3)

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2015     801
8      NZ     2  2016     758
9      NZ     4  2014     691
10     NZ     1  2015     883
11  India     2  2017     782

In [195]:
df=pd.read_csv('Football.csv')
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [196]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     660 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

In [197]:
df.isnull()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
656,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
657,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
658,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
659,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [198]:
df.isnull().sum()

Country                    0
League                     0
Club                       0
Player Names               0
Matches_Played             0
Substitution               0
Mins                       0
Goals                      0
xG                         0
xG Per Avg Match           0
Shots                      0
OnTarget                   0
Shots Per Avg Match        0
On Target Per Avg Match    0
Year                       0
dtype: int64

In [201]:
df.describe(percentiles=[0.80])

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
80%,32.000000,6.000000,2915.800000,15.000000,14.076000,0.610000,90.000000,39.000000,3.600000,1.630000,2020.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [203]:
df["Mins"].quantile(.80)

2915.8

In [204]:
df['Mins'].quantile(.99)

3520.0199999999995

In [205]:
de = df.copy()
de.head(3)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016

In [207]:
de['Year+100']=de['Year']+100
de.head(3)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year,Year+100
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016,2116
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016,2116
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016,2116

In [208]:
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [210]:
df["Player Names"].value_counts()

array([5, 4, 3, 2, 1], dtype=int64)

In [213]:
print(df['Player Names'].unique())

['Juanmi Callejon' 'Antoine Griezmann' 'Luis Suarez' 'Ruben Castro'
 'Kevin Gameiro' 'Cristiano Ronaldo' 'Karim Benzema' 'Neymar '
 'Iago Aspas' 'Sergi Enrich' 'Aduriz ' 'Sandro Ramlrez' 'Lionel Messi'
 'Gerard Moreno' 'Morata' 'Wissam Ben Yedder' 'Willian Jose' 'Andone '
 'Cedric Bakambu' 'Isco' 'Mohamed Salah' 'Gregoire Defrel' 'Ciro Immobile'
 'Nikola Kalinic' 'Dries Mertens' 'Alejandro Gomez' 'Jose CallejOn'
 'Iago Falque' 'Giovanni Simeone' 'Mauro Icardi' 'Diego Falcinelli'
 'Cyril Thereau' 'Edin Dzeko' 'Lorenzo Insigne' 'Fabio Quagliarella'
 'Borriello ' 'Carlos Bacca' 'Gonzalo Higuain' 'Keita Balde'
 'Andrea Belotti' 'Fin Bartels' 'Lars Stindl' 'Serge Gnabry' 'Wagner '
 'Andrej Kramaric' 'Florian Niederlechner' 'Robert Lewandowski'
 'Emil Forsberg' 'Timo Werner' 'Nils Petersen' 'Vedad Ibisevic'
 'Mario Gomez' 'Maximilian Philipp' 'A\x81dam Szalai'
 'Pierre-Emerick Aubameyang' 'Guido Burgstaller' 'Max Kruse' 'Chicharito '
 'Anthony Modeste' 'Arjen Robben' 'Alexis Sanchez' 'Romelu Lukaku'
 'Harry Kane' 'Jamie Vardy' 'Christian Benteke' 'Pedro None' 'Eden Hazard'
 'Roberto Firmino' 'Sadio Mane' 'Philippe Coutinho' 'Diego Costa'
 'Dele Alli' 'Sergio Aguero' 'Jermain Defoe' 'Fernando Llorente'
 'Michail Antonio' 'Zlatan Ibrahimovic' 'Olivier Giroud' 'Son Heung-Min'
 'Joshua King' 'Diego Souza' 'Pablo ' 'Robinho ' 'Kempes ' 'Gabriel Jesus'
 'Bruno Rangel ' 'Rogerio ' 'Vitor Bueno' 'Marinho ' 'Grafite '
 'Andres Chavez' 'Cicero Semedo' 'Sassa' 'Giorgian de Arrascaeta' 'Keno '
 'Fred ' 'Kleber Gladiador' 'Pottker ' 'Jonathan Copete'
 'Ricardo Oliveira' 'Angel Rodriguez' 'Gareth Bale' 'Rodrigo None'
 'Sergio Leon' 'Maxi Gomez' 'Mikel Oyarzabal' 'Willian Josa' 'Simone Zaza'
 'Portu ' 'Cristhian Stuani' 'Santi Mina' 'Morales ' 'Munir '
 'Jose Callejon' 'Sergej Milinkovic-Savic' 'Duvan Zapata' 'Paulo Dybala'
 'Mirco Antenucci' 'Luis Alberto' 'Roberto Inglese' 'Josip Ilicic'
 'Ivan Perisic' 'Leonardo Pavoletti' 'Kevin Lasagna' 'Niclas Fullkrug'
 'Salomon Kalou' 'Thorgan Hazard' 'Jean-Kevin Augustin' 'Sandro Wagner '
 'Leon Bailey' 'Daniel Didavi' 'Alfred Finnbogason' 'Davie Selke'
 'Mark Uth' 'Michael Gregoritsch' 'Julian Brandt' 'Kevin Volland' 'Roger '
 'Arthur Caike' 'Everton ' 'Hernanes ' 'Luiz Fernando'
 'Wellington Paulista' 'Santiago Trellez' 'Jo' 'Thiago Neves'
 'Bruno Henrique' 'Dudu ' 'Diego ' 'Lucca ' 'Henrique Dourado' 'Andre'
 'Edigar Junio ' 'Junior  Dutra' 'Jaime Mata' 'Inaki Williams'
 'Chimy Avila' 'Raul de Tomas' 'Pablo Sarabia' 'Borja Iglesias'
 'Jorge Molina' 'Charles' 'Arkadiusz Milik' 'Mandzukic None'
 'Andrea Petagna' 'Francesco Caputo' 'Stephan El Shaarawy' 'Gervinho '
 'Krzysztof Piatek' 'Alassane Plea' 'Kai Havertz' 'Luka Jovic'
 'Ante Rebic' 'Jadon Sancho' 'Ondrej Duda' 'Paco Alcacer' 'Benito Raman'
 'Wout Weghorst' 'Ishak Belfodil' 'Marco Reus' 'Jean-Philippe Mateta'
 'Sebastien Haller' 'Yussuf Poulsen' 'Angel Di Maria' 'Remi Oudin'
 'Nicolas Pepe' 'Emiliano Sala' 'Jonathan Bamba' "M'Baye Niang"
 'Edinson Cavani' 'Stephane Bahoken' 'Max Gradel' 'Florian Thauvin'
 'Kylian Mbappe-Lottin' 'Wahbi Khazri' 'Falcao ' 'Gaetan Laborde'
 'Andy Delort' 'Moussa Dembele' 'Memphis Depay' 'Lebo Mothiba'
 'Francois Kamano' 'Luka Milivojevic' 'Paul Pogba' 'Ashley Barnes'
 'Glenn Murray' 'Richarlison ' 'Callum Wilson' 'Gylfi Sigurdsson'
 'Raheem Sterling' 'Ayoze Perez' 'Alexandre Lacazette' 'Raul Jimenez'
 'Lucas Paqueta' 'Juan Cazares' 'Deyverson ' 'Leandro Damiao '
 'Yago Pikachu' 'Rodrygo ' 'Andres Rios' 'Roger Guedes '
 'Leandro Pereira ' 'Pedro ' 'Nico Lupez' 'Nene ' 'Gilberto ' 'Henrique '
 'Willian ' 'Gabriel Barbosa' 'Diego Rossi' 'Josef Martinez'
 'Chris Wondolowski' 'Nani ' 'Kacper Przybylko' 'Kei Kamara' 'C.J. Sapong'
 'Gyasi Zardes' 'Heber ' 'Mauro Manotas' 'Brian Fernandez'
 'Alejandro Pozuelo' 'Felipe Gutierrez' 'Jordan Morris' 'Raul Ruidiaz'
 'Jozy Altidore' 'Carlos Vela' 'Nemanja Nikolic' 'Alexandru Mitrita'
 'Joselu' 'Carlos Fernandez' 'Ante Budimir' 'Lucas Perez' 'Loren Moron'
 'Raul Garcla' 'Morata ' 'Sergio Ramos' 'Lucas Ocampos' 'Cazorla ' 'Pote '
 'Tiquinho Soares' 'Eduardo Mancha' 'Paulinho ' 'Alex Telles'
 'Bruno Viana' 'Mehrdad Mohammadi' 'Carlos Valenzuela' 'Ruben Lameiras'
 'Moussa Marega' 'Gian-Luca Waldschmidt' 'Samuel Lino' 'Andre Andre'
 'Mehdi Taremi' 'Carlos Vinicius' 'Sergio Oliveira' 'Douglas Tanque'
 'Fabio Abreu' 'Brayan Riascos' 'Alex Telles ' 'Fabio Martins'
 'Haris  Seferovic' 'Joao Teixeira' 'Bruno Fernandes' 'Angel Gomes'
 'Toni MartÃ\xadnez' 'Pizzi ' 'Bozhidar Kraev' 'Sandro Lima'
 'Rodrigo Pinho' 'Thiago Santana' 'Trincao ' 'Andraz Sporar'
 'Ricardo Horta' 'Bruno Duarte' 'Nuno Santos' 'Domenico Berardi'
 'Joao Pedro' 'Andreas Cornelius' 'Marco Mancosu' 'Lautaro Martrinez'
 'Luis Muriel' 'Gianluca Lapadula' 'Marcus Thuram' 'Rouwen Hennings'
 'Andre Silva' 'Erling Haaland' 'Jhon Cordoba' 'Robin Quaison'
 'Sebastian Andersson' 'Dimitri Payet' 'Kasper Dolberg' 'Adrien Thomasson'
 'Dario Benedetto' 'Ludovic Ajorque' 'Islam Slimani' 'Adrien Hunou'
 'Denis Bouanga' 'Sehrou Guirassy' 'Ã\x81ngel Di Maria' 'Habib Diallo'
 'Victor Osimhen' 'Dominic Calvert-Lewin' 'Kevin De Bruyne' 'Chris Wood'
 'Anthony Martial' 'Riyad Mahrez' 'Marcus Rashford' 'Danny Ings'
 'Richarlison  ' 'Teemu Pukki' 'Tammy Abraham' 'Thiago Galhardo'
 'Paolo Guerrero' 'Pepe' 'Michael ' 'Carlos Sanchez' 'Everaldo ' 'Artur '
 'Marcelo  Cirino' 'Yeferson Soteldo' 'Eduardo Sasha' 'Rafael Moura'
 'Antony None' 'Quincy Promes' 'Dusan Tadic' 'Armando Broja'
 'Steven Berghuis' 'Michael de Leeuw' 'Lois Openda' 'Danilo Nome'
 'Lennart Thy' 'Donyell Malen' 'Noni Madueke' 'Davy Klaassen'
 'Oussama Tannane' 'Vaclav Cerny' 'Vangelis Pavlidis' 'Henk Veerman'
 'Abdou Harroui' 'Rai Vloet' 'Lassina Traore' 'Georgios Giakoumakis'
 'Alex Pozuelo' 'Kevin Molino' 'Damir Kreilach' 'Bradley Wright-Phillips'
 'Nicolas Lodeiro' 'Daryl Dike' 'Cristian Pavon' 'Chris Mueller'
 'Romell Quioto' 'Gustavo Bou' 'Robert Beric' 'Ayo Akinola'
 'Jeremy Ebobisse' 'Diego Valeri' 'Youssef   En-Nesyri' 'Carlos Soler'
 'Cristian Tello' 'Esteban Burgos' 'Joao Felix' 'Federico Valverde'
 'Kike GarcIa' 'Ansu Fati' 'Roberto Soriano' 'Gaetano Castrovilli'
 'Henrikh Mkhitaryan' 'Jordan Veretout' 'Lautaro MartInez'
 'Hirving Lozano' 'Lucas Alario' 'Bas Dost' 'Dani Olmo' 'Ellyes Skhiri'
 'Thomas Muller' 'Andre Hahn' 'Daniel Caligiuri' 'Matheus Cunha'
 'Ludovic Blas' 'Karl Toko' 'Burak Yilmaz' 'Ibrahima Niane' 'Boulaye Dia'
 'Moise Kean' 'Ignatius Ganago' 'Irvin Cardona' 'Wissam Ben'
 'Amine Gouiri' 'Mama Balde' 'Gael Kakuta' 'James Ward-Prowse'
 'Diogo Jota' 'Wilfried Zaha' 'Jack Grealish' 'Jarrod Bowen'
 'Patrick Bamford' 'Danny Ings ' 'Neal Maupay' 'Ollie Watkins' 'Luciano '
 'Vinicius ' 'Raphael Veiga' 'Luiz Adriano' 'Cleber ' 'German Cano'
 'Brenner None' 'Matheus Babi' 'Alerrandro ' 'Claudinho ' 'Robson'
 'Renato Kayzer' 'Donny van de Beek' 'Teun Koopmeiners' 'Cantalapiedra '
 'Bryan Linssen' 'Matavz ' 'Oussama Idrissi' 'Chidera Ejuke' 'Myron Boadu'
 'Klaas-Jan Huntelaar' 'Haris Vuckic' 'Gyrano Kerk' 'Denzel Dumfries'
 'Cyriel Dessers ' 'Cody Gakpo']

In [214]:
df['Player Names'].nunique()

444

In [215]:
df.dropna(inplace=True,axis=0)

In [216]:
df.dropna(inplace=True,axis=1)

In [217]:
df.sample(5)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
143,Germany,Bundesliga,(BOT),Salomon Kalou,27,4,2272,12,9.33,0.39,50,23,2.09,0.96,2017
126,Italy,Serie A,(SAM),Fabio Quagliarella,33,2,2864,19,17.79,0.59,113,46,3.75,1.53,2017
299,Brazil,Campeonato Brasileiro SÃ©rie A,(FLA),Gabriel Barbosa,34,1,3140,18,19.17,0.58,94,40,2.84,1.21,2018
527,Spain,La Liga,(ALA),Lucas Perez,7,2,637,3,4.36,0.65,13,6,1.94,0.89,2020
625,Brazil,Campeonato Brasileiro SÃ©rie A,(CEA),Cleber,17,3,1336,5,6.75,0.48,41,13,2.92,0.92,2020

In [219]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)

df.to_csv('Number1.csv')

In [220]:
df.to_csv('Numbers1.csv', index = False)